askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDU14.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRDU14.bootloader.BOOTSIZE=0x01
AVRDU14.bootloader.CODESIZE=0x00
AVRDU14.bootloader.OSCCFG=0b00000000
AVRDU14.bootloader.SYSCFG0=0b111{bootloader.updi_bit}{bootloader.reset_bit}{bootloader.browsave_bit}{bootloader.eesave_bit}
AVRDU14.bootloader.SYSCFG1=0b000{bootloader.usbsink_bit}000
AVRDU14.bootloader.WDTCFG=0b00000000
AVRDU14.bootloader.bod_lvl=000
AVRDU14.bootloader.bod_mode=00
AVRDU14.bootloader.bod_sample=0
AVRDU14.bootloader.tool=avrdude
AVRDU14.bootloader.eepupload=
AVRDU14.bootloader.eesave_bit=1
AVRDU14.bootloader.browsave_bit=0
AVRDU14.bootloader.usbsink_bit=01
AVRDU14.bootloader.reset_bit=10
AVRDU14.bootloader.updi_bit=1
AVRDU14.bootloader.programed_type=.with_bootloader
AVRDU14.build.export_merged_output=true
AVRDU14.build.text_section_start=.text=0x200
AVRDU14.build.buildopt=-DNDEBUG
AVRDU14.build.console_baud=-DCONSOLE_BAUD=9600
AVRDU14.build.led_pin=-DLED_BUILTIN=PIN_PD7
AVRDU14.build.macroapi=-DENABLE_MACRO_API
AVRDU14.build.printf=
AVRDU14.build.printflt=
AVRDU14.upload.protocol=arduino
AVRDU14.upload.speed=115200
AVRDU14.upload.tool=avrdude
AVRDU14.menu.01_variant.53_AVR32DU14.build.board=AVR_AVR32DU14
AVRDU14.menu.01_variant.53_AVR32DU14.build.mcu=avr32du14
AVRDU14.menu.01_variant.53_AVR32DU14.build.variant=avr_du14
AVRDU14.menu.01_variant.53_AVR32DU14.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p512.x
AVRDU14.menu.01_variant.53_AVR32DU14.upload.maximum_data_size=4096
AVRDU14.menu.01_variant.53_AVR32DU14.upload.maximum_size=32256
AVRDU14.menu.01_variant.53_AVR32DU14=14pin AVR32DU14 (32KiB+4KiB)
AVRDU14.menu.01_variant.54_AVR16DU14.build.board=AVR_AVR16DU14
AVRDU14.menu.01_variant.54_AVR16DU14.build.mcu=avr16du14
AVRDU14.menu.01_variant.54_AVR16DU14.build.variant=avr_du14
AVRDU14.menu.01_variant.54_AVR16DU14.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p512.x
AVRDU14.menu.01_variant.54_AVR16DU14.upload.maximum_data_size=2048
AVRDU14.menu.01_variant.54_AVR16DU14.upload.maximum_size=15872
AVRDU14.menu.01_variant.54_AVR16DU14=14pin AVR16DU14 (16KiB+2KiB)
AVRDU14.menu.02_clock.01_24MHz.bootloader.bod_sample=0
AVRDU14.menu.02_clock.01_24MHz.build.f_cpu=24000000L
AVRDU14.menu.02_clock.01_24MHz=Internal 24 MHz (default)
AVRDU14.menu.02_clock.01_12MHz.bootloader.bod_sample=0
AVRDU14.menu.02_clock.01_12MHz.build.f_cpu=12000000L
AVRDU14.menu.02_clock.01_12MHz=Internal 12 MHz
AVRDU14.menu.02_clock.03_6MHz.bootloader.bod_sample=0
AVRDU14.menu.02_clock.03_6MHz.build.f_cpu=6000000L
AVRDU14.menu.02_clock.03_6MHz=Internal 6 MHz
AVRDU14.menu.02_clock.04_3MHz.bootloader.bod_sample=0
AVRDU14.menu.02_clock.04_3MHz.build.f_cpu=3000000L
AVRDU14.menu.02_clock.04_3MHz=Internal 3 MHz
AVRDU14.menu.02_clock.10=-
AVRDU14.menu.02_clock.11_20MHz.bootloader.bod_sample=0
AVRDU14.menu.02_clock.11_20MHz.build.f_cpu=20000000L
AVRDU14.menu.02_clock.11_20MHz=Internal 20 MHz (recommend)
AVRDU14.menu.02_clock.12_10MHz.bootloader.bod_sample=0
AVRDU14.menu.02_clock.12_10MHz.build.f_cpu=10000000L
AVRDU14.menu.02_clock.12_10MHz=Internal 10 MHz
AVRDU14.menu.02_clock.13_5MHz.bootloader.bod_sample=0
AVRDU14.menu.02_clock.13_5MHz.build.f_cpu=5000000L
AVRDU14.menu.02_clock.13_5MHz=Internal 5 MHz
AVRDU14.menu.02_clock.20=-
AVRDU14.menu.02_clock.21_16MHz.bootloader.bod_sample=0
AVRDU14.menu.02_clock.21_16MHz.build.f_cpu=16000000L
AVRDU14.menu.02_clock.21_16MHz=Internal 16 MHz
AVRDU14.menu.02_clock.22_8MHz.bootloader.bod_sample=0
AVRDU14.menu.02_clock.22_8MHz.build.f_cpu=8000000L
AVRDU14.menu.02_clock.22_8MHz=Internal 8 MHz
AVRDU14.menu.02_clock.23_4MHz.bootloader.bod_sample=0
AVRDU14.menu.02_clock.23_4MHz.build.f_cpu=4000000L
AVRDU14.menu.02_clock.23_4MHz=Internal 4 MHz
AVRDU14.menu.02_clock.24_2MHz.bootloader.bod_sample=0
AVRDU14.menu.02_clock.24_2MHz.build.f_cpu=2000000L
AVRDU14.menu.02_clock.24_2MHz=Internal 2 MHz
AVRDU14.menu.02_clock.25_1MHz.bootloader.bod_sample=0
AVRDU14.menu.02_clock.25_1MHz.build.f_cpu=1000000L
AVRDU14.menu.02_clock.25_1MHz=Internal 1 MHz
AVRDU14.menu.02_clock.30=-
AVRDU14.menu.02_clock.31_32MHz.bootloader.bod_sample=0
AVRDU14.menu.02_clock.31_32MHz.build.f_cpu=32000000L
AVRDU14.menu.02_clock.31_32MHz=Internal 32 MHz (OVERCLOCK)
AVRDU14.menu.02_clock.32_28MHz.bootloader.bod_sample=0
AVRDU14.menu.02_clock.32_28MHz.build.f_cpu=28000000L
AVRDU14.menu.02_clock.32_28MHz=Internal 28 MHz (OVERCLOCK)
AVRDU14.menu.02_clock.33_14MHz.bootloader.bod_sample=0
AVRDU14.menu.02_clock.33_14MHz.build.f_cpu=14000000L
AVRDU14.menu.02_clock.33_14MHz=Internal 14 MHz (OVERCLOCK)
AVRDU14.menu.02_clock.34_7MHz.bootloader.bod_sample=0
AVRDU14.menu.02_clock.34_7MHz.build.f_cpu=7000000L
AVRDU14.menu.02_clock.34_7MHz=Internal 7 MHz (OVERCLOCK)
AVRDU14.menu.02_clock.40=-
AVRDU14.menu.02_clock.41_32768Hz.bootloader.bod_sample=1
AVRDU14.menu.02_clock.41_32768Hz.build.f_cpu=32256
AVRDU14.menu.02_clock.41_32768Hz=Internal 32.768 kHz (ULP)
AVRDU14.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
AVRDU14.menu.11_BODMODE.01_disabled=BOD Disabled
AVRDU14.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
AVRDU14.menu.11_BODMODE.02_enabled=BOD Enabled
AVRDU14.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
AVRDU14.menu.11_BODMODE.03_sampled=BOD Sampled
AVRDU14.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
AVRDU14.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
AVRDU14.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
AVRDU14.menu.12_BODLVL.BODLEVEL0=Level 1.9V (default)
AVRDU14.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
AVRDU14.menu.12_BODLVL.BODLEVEL1=Level 2.45V
AVRDU14.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
AVRDU14.menu.12_BODLVL.BODLEVEL2=Level 2.7V
AVRDU14.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
AVRDU14.menu.12_BODLVL.BODLEVEL3=Level 2.85V
AVRDU14.menu.21_resetpin.01_reset.bootloader.reset_bit=10
AVRDU14.menu.21_resetpin.01_reset=PF6 pin=Reset
AVRDU14.menu.21_resetpin.02_gpio.bootloader.reset_bit=00
AVRDU14.menu.21_resetpin.02_gpio=PF6 pin=GPIO (input only)
AVRDU14.menu.22_updipin.01_updi.bootloader.updi_bit=1
AVRDU14.menu.22_updipin.01_updi=PF7 pin=UPDI (default)
AVRDU14.menu.22_updipin.02_gpio.bootloader.updi_bit=0
AVRDU14.menu.22_updipin.02_gpio=PF7 pin=GPIO (DANGER:NOT RECOMMENDED)
AVRDU14.menu.23_eeprom.01_keep.bootloader.eesave_bit=1
AVRDU14.menu.23_eeprom.01_keep=Save guard "Retained"
AVRDU14.menu.23_eeprom.02_erase.bootloader.eesave_bit=0
AVRDU14.menu.23_eeprom.02_erase=Save guard "Erase"
AVRDU14.menu.23_eeprom.03_replace.bootloader.eepupload={bootloader.eeprom}
AVRDU14.menu.23_eeprom.03_replace.bootloader.eesave_bit=1
AVRDU14.menu.23_eeprom.03_replace="Erase" and "Replace"
AVRDU14.menu.25_bootrow.01_erase.bootloader.browsave_bit=0
AVRDU14.menu.25_bootrow.01_erase=Save guard "Erase"
AVRDU14.menu.25_bootrow.02_keep.bootloader.browsave_bit=1
AVRDU14.menu.25_bootrow.02_keep=Save guard "Retained"
AVRDU14.menu.26_usbsinkcfg.01_enable.bootloader.usbsink_bit=01
AVRDU14.menu.26_usbsinkcfg.01_enable=USBSINK "Enable" (default)
AVRDU14.menu.26_usbsinkcfg.02_disable.bootloader.usbsink_bit=00
AVRDU14.menu.26_usbsinkcfg.02_disable=USBSINK "Disable"
AVRDU14.menu.51_buildopt.01_Release=Build Release (default)
AVRDU14.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
AVRDU14.menu.51_buildopt.02_Debug1=Build DEBUG=1
AVRDU14.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
AVRDU14.menu.51_buildopt.03_Debug2=Build DEBUG=2
AVRDU14.menu.52_macroapi.01_Enable=Macro API Enable (default)
AVRDU14.menu.52_macroapi.02_Disable.build.macroapi=
AVRDU14.menu.52_macroapi.02_Disable=Macro API Disable
AVRDU14.menu.52_macroapi.03_AllDisable.build.macroapi=
AVRDU14.menu.52_macroapi.03_AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVRDU14.menu.52_macroapi.03_AllDisable=Standard Library All Disable
AVRDU14.menu.53_printf.01_default=default
AVRDU14.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
AVRDU14.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRDU14.menu.53_printf.02_full=Float Support
AVRDU14.menu.90_console_baud.01_9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVRDU14.menu.90_console_baud.01_9600bps=CONSOLE_BAUD=9600 bps (default)
AVRDU14.menu.90_console_baud.03_38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVRDU14.menu.90_console_baud.03_38400bps=CONSOLE_BAUD=38400 bps
AVRDU14.menu.90_console_baud.04_57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVRDU14.menu.90_console_baud.04_57600bps=CONSOLE_BAUD=57600 bps
AVRDU14.menu.90_console_baud.05_115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVRDU14.menu.90_console_baud.05_115200bps=CONSOLE_BAUD=115200 bps
AVRDU14.menu.90_console_baud.06_230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVRDU14.menu.90_console_baud.06_230400bps=CONSOLE_BAUD=230400 bps
AVRDU14.menu.90_console_baud.14_500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVRDU14.menu.90_console_baud.14_500000bps=CONSOLE_BAUD=500000 bps
AVRDU14.menu.90_console_baud.15_1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRDU14.menu.90_console_baud.15_1000000bps=CONSOLE_BAUD=1000000 bps
AVRDU14.menu.90_console_baud.20=-
AVRDU14.menu.90_console_baud.21_2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVRDU14.menu.90_console_baud.21_2400bps=CONSOLE_BAUD=2400 bps (for ULP)
AVRDU14.menu.95_bootloader.01_UART0_A0_LD7.bootloader.file=hex/boot_avrdu_UART0_A0_{upload.speed}_LD7.hex
AVRDU14.menu.95_bootloader.01_UART0_A0_LD7.build.console_select=-DSerial=Serial0A
AVRDU14.menu.95_bootloader.01_UART0_A0_LD7=UART0 TX:PA0 RX:PA1 LED=PD7 (default)
AVRDU14.menu.95_bootloader.02_UART0_D6_LC3.bootloader.file=hex/boot_avrdu_UART1_D6_{upload.speed}_LC3.hex
AVRDU14.menu.95_bootloader.02_UART0_D6_LC3.build.console_select=-DSerial=Serial1C
AVRDU14.menu.95_bootloader.02_UART0_D6_LC3=UART1 TX:PD6 RX:PD7 LED=PC3 (alt)


